import java.awt.*;
import javax.swing.*;


public class Inwons extends JApplet  {
 private JScrollPane panel;
 private JTable table;
 private JSplitPane spane;
 private String [] columnName = {"아이디","성명","시험지","시험시작시간","답안제출시간","득점","원득점","가감내용","응시자 IP"};//컬럼명 배열
 private  Object[][] array = {{"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},//입력값들 배열
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"},
        {"111111111111","테스트","1","2008-05-30 11:21:24","2008-05-30 11:21:24","80","","","111.222.333.444"}};
  
 public void init() {
   table = new JTable(array, columnName);   //테이블선언
   table.setPreferredScrollableViewportSize(new Dimension(250,80)); //테이블사이즈선언
   panel = new JScrollPane(table);   //테이블을 넣기위한 JScrollPane선언
   add(panel);   //scrollpane을 frame에 add
   setSize(1400,500);
   setVisible(true);
  }
}